Tekla Open API Reference for Tekla Structures 2025
TemplateInfo.Name Property
 Gets or sets the name of the template file. E.g. "revision".
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
TemplateInfo Class
Tekla.Structures.Drawing Namespace